In [1]:
import pandas as pd

In [2]:
excel = pd.ExcelFile('SuperMarket_Transaction_Data.xlsx')

In [3]:
df = excel.parse(excel.sheet_names[0])

In [4]:
df.head()

,Invoice_id,Cust_id,Txn_date,Product_Sub_category,Product_Category,Qty,Rate,Tax,Total_Amt,Store_type
0,25890929042,266783,2016-09-23,Women,Footwear,4,1321,554.820,5838.820,e-Shop
1,25890929042,266783,2016-09-24,Women,Footwear,-4,-1321,554.820,-5838.820,e-Shop
2,98477711300,266783,2017-10-21,Mens,Clothing,3,93,29.295,308.295,TeleShop
3,8410316370,266783,2018-02-20,Mens,Clothing,1,869,91.245,960.245,e-Shop
4,16999552161,266783,2018-09-02,Non-fiction,Books,2,835,175.350,1845.350,e-Shop

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21988 entries, 0 to 21987
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Invoice_id            21988 non-null  int64
 1   Cust_id               21988 non-null  int64
 2   Txn_date              21988 non-null  datetime64[ns]
 3   Product_Sub_category  21988 non-null  object
 4   Product_Category      21988 non-null  object
 5   Qty                   21988 non-null  int64
 6   Rate                  21988 non-null  int64
 7   Tax                   21988 non-null  float64
 8   Total_Amt             21988 non-null  float64
 9   Store_type            21988 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(4), object(3)
memory usage: 1.7+ MB

In [6]:
#duplicates
duplicates = df.duplicated().sum()
print(duplicates)

13

In [7]:
#drop duplicates
df= df.drop_duplicates()

In [8]:
#check
duplicates = df.duplicated().sum()
print(duplicates)

0

In [9]:
#checking info
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21975 entries, 0 to 21987
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Invoice_id            21975 non-null  int64
 1   Cust_id               21975 non-null  int64
 2   Txn_date              21975 non-null  datetime64[ns]
 3   Product_Sub_category  21975 non-null  object
 4   Product_Category      21975 non-null  object
 5   Qty                   21975 non-null  int64
 6   Rate                  21975 non-null  int64
 7   Tax                   21975 non-null  float64
 8   Total_Amt             21975 non-null  float64
 9   Store_type            21975 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(4), object(3)
memory usage: 1.8+ MB

In [10]:
#separating returns from DF
df_returns = df[df['Qty'] < 0]

In [11]:
#?df_returns info
df_returns.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2054 entries, 1 to 21978
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Invoice_id            2054 non-null   int64
 1   Cust_id               2054 non-null   int64
 2   Txn_date              2054 non-null   datetime64[ns]
 3   Product_Sub_category  2054 non-null   object
 4   Product_Category      2054 non-null   object
 5   Qty                   2054 non-null   int64
 6   Rate                  2054 non-null   int64
 7   Tax                   2054 non-null   float64
 8   Total_Amt             2054 non-null   float64
 9   Store_type            2054 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(4), object(3)
memory usage: 176.5+ KB

In [12]:
#DF with no returns
df = df[df['Qty']>=0]

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19921 entries, 0 to 21987
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Invoice_id            19921 non-null  int64
 1   Cust_id               19921 non-null  int64
 2   Txn_date              19921 non-null  datetime64[ns]
 3   Product_Sub_category  19921 non-null  object
 4   Product_Category      19921 non-null  object
 5   Qty                   19921 non-null  int64
 6   Rate                  19921 non-null  int64
 7   Tax                   19921 non-null  float64
 8   Total_Amt             19921 non-null  float64
 9   Store_type            19921 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(4), object(3)
memory usage: 1.7+ MB

In [14]:
#stat for numeric columns
df[['Qty', 'Rate', 'Tax', 'Total_Amt']].describe()

                Qty          Rate           Tax     Total_Amt
count  19921.000000  19921.000000  19921.000000  19921.000000
mean       3.003162    785.949250    247.664935   2606.378604
std        1.420921    415.824713    186.458986   1962.258855
min        1.000000     70.000000      7.350000     77.350000
25%        2.000000    425.000000     97.860000   1029.860000
50%        3.000000    788.000000    198.240000   2086.240000
75%        4.000000   1148.000000    363.300000   3823.300000
max        5.000000   1500.000000    787.500000   8287.500000

In [15]:
#unique for category types
print(df['Product_Sub_category'].unique())
print(df['Product_Category'].unique())
print(df['Store_type'].unique())

['Women' 'Mens' 'Non-fiction' 'Mobiles' 'Fiction' 'Kids'
 'Home Decoratives' 'Academic' 'Audio and video' 'Personal Appliances'
 'Computers' 'DIY' 'Electric appliances' 'Furnishing' 'Cameras'
 'Bedding and Towels']
['Footwear' 'Clothing' 'Books' 'Electronics' 'Home and kitchen' 'Bags']
['e-Shop' 'TeleShop' 'Brick and Mortar']

In [16]:
#NA values
df.isna().sum()

Invoice_id              0
Cust_id                 0
Txn_date                0
Product_Sub_category    0
Product_Category        0
Qty                     0
Rate                    0
Tax                     0
Total_Amt               0
Store_type              0
dtype: int64

In [17]:
#saving clean data
df.to_csv('clean_data.csv', index=False)

In [19]:
#saving clean data
df_returns.to_csv('clean_data_returns.csv', index=False)